#    $Author: belal (risha) $
#    $Revision: 1.5 $

def afaal():
    
    verb_prefix = ('|ل|ف|أ|ي|ت|ن')
    
    verb_suffix = ('|ا|ه|ي|ت|ى|و|ك|ها|تها|هم|تهم|هما|تهما|هن|تهن|كما|كن|كم|نا|ني|ان|ون|ين|يه|وا|ما|تا')
    
    #  (فال) (فعا) (فعى) افعل يفعل انفعل ينفعل يفاعل تفعل تفاعل افتعل تفعيل استفعل افعوعل افعول تفعلل يتفعلل افعنلل افعلل  يتفعل يتفاعل يفتعل يستفعل افتعلى فعل
    verb_conjugations = '.ا.|..(ا|ى)|ا...|ي...|ان...|ين...|ي.ا..|ت...|ت.ا..|ا.ت..|ت..ي.|است...|ا..و..|ا..و.|ت....|يت....|ا..ن..|ا....|يت...|يت.ا..|ي.ت..|يست...|ا.ت..ى|...'
                
    afaal = u'^({0})({1})({2})$'.format(verb_prefix, verb_conjugations, verb_suffix)
    return afaal