#    $Author: belal (risha) $
#    $Revision: 1.5 $

def asmaa():
    
    noun_prefix = ('|ب|ك|ل|ف|أ|م|لل')
    
    noun_suffix = ('|ا|ك|ه|ي|ل|ى|ها|تها|هم|تهم|هما|تهما|هن|تهن|ما|كما|كن|كم|نا|ان|ون|ين|وت|يه|تا|ات')
    
    # فعيل فعال فعول افعال مفعول مفعال مفعيل فعليل فعلاء فعلان فعلى فيعل مفعل فاعول استفعال تفعيل مفتعل افعال
    noun_conjugations = '..ي.|..ا.|[^أ].و.|ا..ا.|م..و.|م..ا.|م..ي.|...ي.|...اء|...ان|...ى|.ي..|م...|.ا.و.|است..ا.|ت..ي.|م.ت..|ا..ا.'  
                        
    asmaa = u'^({0})({1})({2})$'.format(noun_prefix, noun_conjugations, noun_suffix)
    return asmaa