#    $Author: belal (risha) $
#    $Revision: 1.5 $

def horoof():

    particle_prefix = ('|ب|ك|ل|ف|أ|و')

    particle_suffix = ('|ا|ك|ه|ي|ها|تها|هم|تهم|هما|تهما|هن|تهن|ما|كما|كن|كم|نا')
    
    particles = ("يا|أ|أيا|ايا|هيا|نعم|لا|أجل|اجل|بلى|إي|اي|كلا|إذن|اذن|ثم|أو|او|أم|بل|حتى|لكن|من|إلى|الى|في|عن|على|مذ|منذ|كي|لعل|إلا|ام|هل|أي|لم|إن|غير|لما|لن|ألا|أما|اما|ليت|عسى|إذا|أن|إذ|كي|حتي|اذا|كلما|لو|لولا|لوما|طالما|آ|عل|قد|كأن|ما|علي|ل|ب|مع|أيضا|ايضا|ممن|حيث|ثم|لماذا|بين|اين|متى|اذ|إذ|ع|ك|ريث|متي|كيف")    
    horoof = u'^({0})({1})({2})$'.format(particle_prefix, particles, particle_suffix)
    return horoof



"""
#         horoof = {
#             'Voctal': 'يا أ أيا هيا وا'
#             'Answer': 'نعم لا أجل بلى إي كلا إذن'
#             'Conj': 'و ثم أو أم بل حتى لكن'
#             'Genitive': 'من إلى في عن على مذ منذ رب كي لعل حتى لولا'
#             'Exception': 'إلا'
#             'Interro': 'أم هل أ أي'
#             'Negative': 'لم إن غير لات لما لن لا'
#             'Excpect': 'قد'
#             'Notify': 'ألا أما'
#             'Confirm': 'إن أن قد'
#             'Wishing': 'ليت لو لعل عسى'
#             'Interp': 'إذا أن إذ'
#             'Accusative': 'كأن لكن لعل كي إذن هلا لولا لوما أن لن حتى'
#             'Condition': 'إذا كلما لما لو لولا لوما طالما'
#             'Other': 'آ عل قد'
#         }
"""