#    $Author: belal (risha) $
#    $Revision: 1.0 $

from nouns import nouns
from verbs import verbs

class Patterns:
    def __init__(self):
        pass
    
    
    def get_patterns(self):

        verb_prefix = ('|أ|ن|ت|ي|ف|س|ل|است|يست|تست|نست|سي|ست|سن|سأ|ل|لأ|لي|لت|لاست|يت|ان|ست')
        verb_suffix = ('|ي|ن|نا|تما|تا|تم|تن|يا|وا|ين|ان|ون|ا|ى|هم|هما|هن|ه|ها|ين|لي|لت|لن|لأ|لا|ى|ني|ك|تها|ت')
        #  (فال) (فعا) (فعى) (افع) افعل يفعل انفعل ينفعل يفاعل تفعل تفاعل افتعل تفعيل استفعل افعوعل افعول تفعلل يتفعلل افعنلل افعلل  يتفعل يتفاعل يفتعل يستفعل افتعلى
        verb_conjugations = "[ا-ي]ا[ا-ي]|[ا-ي]{2}ا|[ا-ي]{2}ى|ا[ا-ي]{2}|ا[ا-ي]{3}|ي[ا-ي]{3}|ان[ا-ي]{3}|ين[ا-ي]{3}|ي[ا-ي]ا[ا-ي]{2}|ت[ا-ي]{3}|ت[ا-ي]ا[ا-ي]{2}|ا[ا-ي]ت[ا-ي]{2}|ت[ا-ي]{2}ي[ا-ي]|است[ا-ي]{3}|ا[ا-ي]{2}و[ا-ي]{2}|ا[ا-ي]{2}و[ا-ي]|ت[ا-ي]{4}|يت[ا-ي]{4}|ا[ا-ي]{2}ن[ا-ي]{2}|ا[ا-ي]{4}|يت[ا-ي]{3}|يت[ا-ي]ا[ا-ي]{2}|ي[ا-ي]ت[ا-ي]{2}|يست[ا-ي]{3}|ا[ا-ي]ت[ا-ي]{2}ى"
        
        afaal = u'^({0})({1})({2})$'.format(verb_prefix, verb_conjugations, verb_suffix)
        afaal2 = u'^({0})({1})({2})$'.format(verb_prefix, verbs, verb_suffix)
        
        
        particle_prefix = ('|ب|ه|ك|ل|ف|م')
        particle_suffix = ('|ها|تها|هم|تهم|تهما|هما|هن|تهن|ما|ا|كما|تما|كن|ه|ي')
        particles = ("يا|أ|أيا|هيا|نعم|لا|أجل|بلى|إي|كلا|إذن|ثم|أو|أم|بل|حتى|لكن|من|إلى|في|عن|على|مذ|منذ|كي|لعل|حتى|لولا|إلا|أم|هل|أ|أي|لم|إن|غير|لات|لما|لن|لا|قد|ألا|أما|إن|أن|قد|ليت|لو|لعل|عسى|إذا|أن|إذ|كأن|لكن|لعل|كي|إذن|هلا|لولا|لوما|أن|لن|حتى|إذا|كلما|لما|لو|لولا|لوما|طالما|آ|عل|قد|كأن|ما|علي|مع|ل|ب|مع|أيضا|ايضا")
        
        horoof = u'^({0})({1})({2})$'.format(particle_prefix, particles, particle_suffix)
        
        
        noun_prefix = '|ال|كال|بال|فال|ب|ك|ل|ف'
        noun_suffix = '|ة|ات|ائي|ائك|ائه|اؤك|اؤه|اءك|اءه|هما|كما|اك|ا|ه|ها|ي|ك|نا|ين|ون|نا|ان|ى|هم|هن|ها|تها|تكما|تكن|تهن||تكم|كم'
        # فعللل فعيل فعال فعول افعال مفعول مفعال مفعيل فعلة فعليل فعلاء فعلان فعلى فيعل مفعل مفعلة فعالة فاعلة فاعول استفعال تفعيل مفتعل افعال   
        noun_conjugations = "[ا-ي]{2}ي[ا-ي]|[ا-ي]{2}ا[ا-ي]|[ا-ي]{2}و[ا-ي]|ا[ا-ي]{2}ا[ا-ي]|م[ا-ي]{2}و[ا-ي]|م[ا-ي]{2}ا[ا-ي]|م[ا-ي]{2}ي[ا-ي]|[ا-ي]{3}ة|[ا-ي]{3}ي[ا-ي]|[ا-ي]{3}اء|[ا-ي]{3}ان|[ا-ي]{3}ى|[ا-ي]ي[ا-ي]{2}|م[ا-ي]{3}|م[ا-ي]{3}ة|[ا-ي]{2}ا[ا-ي]ة|[ا-ي]ا[ا-ي]{2}ة|[ا-ي]ا[ا-ي]و[ا-ي]|است[ا-ي]{2}ا[ا-ي]ت[ا-ي]{2}ي[ا-ي]|م[ا-ي]ت[ا-ي]{2}|ا[ا-ي]{2}ا[ا-ي]"        
        
        asmaa = u'^({0})({1})({2})$'.format(noun_prefix, noun_conjugations, noun_suffix)
        asmaa2 = u'^({0})({1})({2})$'.format(noun_prefix, nouns, noun_suffix)
        
        
        
        return afaal, afaal2, horoof, asmaa, asmaa2
    
    
    
    
    
    
    
"""
#         horoof = {
#             'Voctal': 'يا أ أيا هيا وا'
#             'Answer': 'نعم لا أجل بلى إي كلا إذن'
#             'Conj': 'و ثم أو أم بل حتى لكن'
#             'Genitive': 'من إلى في عن على مذ منذ رب كي لعل حتى لولا'
#             'Exception': 'إلا'
#             'Interro': 'أم هل أ أي'
#             'Negative': 'لم إن غير لات لما لن لا'
#             'Excpect': 'قد'
#             'Notify': 'ألا أما'
#             'Confirm': 'إن أن قد'
#             'Wishing': 'ليت لو لعل عسى'
#             'Interp': 'إذا أن إذ'
#             'Accusative': 'كأن لكن لعل كي إذن هلا لولا لوما أن لن حتى'
#             'Condition': 'إذا كلما لما لو لولا لوما طالما'
#             'Other': 'آ عل قد'
#         }
"""